// Напишите программу, которая на вход принимает значение, а на выходе показывает обратное значение.

Console.Write("Enter the number: ");
string s_a = Console.ReadLine();
double a = double.Parse(s_a);
double Reverse = 1 / a;
Console.WriteLine(Reverse);