// Напишите программу вычисления модуля числа.

Console.Write("Enter the number: ");
string s_a = Console.ReadLine();
int a = int.Parse(s_a);
int Modulo = -a;
Console.WriteLine(Modulo);